<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=0.65">
<title>Dikey Geçiş Asistanı</title>
<link rel="stylesheet" href="main.css" />
</head>

<body>
<h1>Ebob Ekok</h1>
<p>Ebob, ekok ifadeleri ancak birbirinden farklı en az iki doğal sayı i&ccedil;in s&ouml;z konusu olabilir. &Ccedil;&uuml;nk&uuml; ortak b&ouml;lenin olabilmesi i&ccedil;in birden fazla sayı olması gerekir.</p>
<p><strong>Ekok (En B&uuml;y&uuml;k Ortak Kat):&nbsp;</strong>Birbirinden farklı en az iki doğal sayıyı ortak b&ouml;lebilen <u>en k&uuml;&ccedil;&uuml;k</u> sayıya <strong>en k&uuml;&ccedil;&uuml;k ortak kat</strong> denir. Ekok şeklinde g&ouml;sterilir.</p>
<p><strong>&Ouml;rnek:</strong></p>
<p>4 ve 6 nın ekok u 12 dir.</p>
<p><strong>Ebob (En B&uuml;y&uuml;k Ortak B&ouml;len):</strong>&nbsp;Birbirinden farklı iki doğal sayıyı ortak b&ouml;lebilen <u>en b&uuml;y&uuml;k</u> sayıya <strong>en b&uuml;y&uuml;k ortak b&ouml;len</strong> denir. Ebob ile g&ouml;sterilir.</p>
<p><strong>&Ouml;rnek:</strong></p>
<p>6 ve 9 un ebob u 3 d&uuml;r.</p>
<h2>Ebob ve Ekok un &Ouml;zellikleri</h2>
<ol>
    <li>A ile B iki doğal sayı ve B &lt; A ise ebob (A, B)&nbsp;<span style="line-height: 12px;">&le; B &lt; A&nbsp;</span><span style="line-height: 12px;">&le; ekok (A, B) dir.</span></li>
    <li>A ve B iki doğal sayı ise A.B = ebob (A, B).ekok (A, B) dir.</li>
    <li>A ve B aralarında asal iki doğal sayı ise bu sayıların ebob(A, B) = 1 olduğu i&ccedil;in ekok(A, B) = A.B olur.</li>
</ol>
<p><strong>&Ouml;rnek:</strong></p>
<p>Boyutları 6 cm, 9 cm ve 15 cm olan bir dikt&ouml;rgenler prizması şeklinde olan kutulardan, bir k&uuml;p elde edebilmek i&ccedil;in <u>en az</u> ka&ccedil; tane kutu kullanmamız gerekiyor.</p>
<p><strong>&Ccedil;&ouml;z&uuml;m:&nbsp;</strong></p>
<p>Kutulardan bir k&uuml;p oluşturduğumuza g&ouml;re k&uuml;p&uuml;n boyutları kutunun boyutlarının ortak katı olması gerekir.&nbsp;En az ka&ccedil; kutu kullanmamızı istediğne g&ouml;re, en k&uuml;&ccedil;&uuml;k ortak katı bulmamız gerekir.</p>
<p>Ekok(6, 9, 15) = 90 dır.</p>
<p>Buna g&ouml;re k&uuml;p&uuml;n bir kenarı 90 cm olmalıdır.</p>
<p>K&uuml;p&uuml;n oluşabilmesi i&ccedil;in 6 cm boyuttan 15 tane, 9 cm boyuttan 10 tane ve 15 cm lik boyuttan 6 adet kullanılması gereklidir.</p>
<p>Yani k&uuml;p oluşturulabilmesi i&ccedil;in 15.10.6 = <strong>900</strong> adet kutu gereklidir.</p>
</body>
</html>
